content/notes/on_doing_less_at_the_right_level.md
---
title: "On Doing Less at the Right Level"
author: ["Darrell Banks"]
date: 2025-10-30T00:00:00-06:00
lastmod: 2025-11-26T00:00:00-07:00
tags: ["notes"]
draft: false
---

**Connections**: [Software Engineering]({{< relref "../categories/software_engineering.md" >}})


## Shift Your Focus: Spend more time on architecture, design reviews, and cross-team coordination instead of routine tickets. I stopped doing worker-bee tickets; now I design and build systems that scale. {#shift-your-focus-spend-more-time-on-architecture-design-reviews-and-cross-team-coordination-instead-of-routine-tickets-dot-i-stopped-doing-worker-bee-tickets-now-i-design-and-build-systems-that-scale-dot}


## Document Influence: Keep a brief log of design decisions, trade-offs, and measurable impacts to use in reviews or when marketing your services. {#document-influence-keep-a-brief-log-of-design-decisions-trade-offs-and-measurable-impacts-to-use-in-reviews-or-when-marketing-your-services-dot}


## Develop non-technical skills: Practice presenting trade-offs to product and leadership, negotiating priorities, and planting ideas with stakeholders so they adopt them as their own. {#develop-non-technical-skills-practice-presenting-trade-offs-to-product-and-leadership-negotiating-priorities-and-planting-ideas-with-stakeholders-so-they-adopt-them-as-their-own-dot}


## Create Leverage: Build reusable patterns, libraries, and standards that reduce repetitive work and increase your visibility. Use generative AI to accelerate creation of these assets, not to replace them. {#create-leverage-build-reusable-patterns-libraries-and-standards-that-reduce-repetitive-work-and-increase-your-visibility-dot-use-generative-ai-to-accelerate-creation-of-these-assets-not-to-replace-them-dot}


## Mentor and delegate: Teach teammates to execute and use generative AI to produce clear specs, acceptance criteria, and example implementations so they can deliver without handholding. {#mentor-and-delegate-teach-teammates-to-execute-and-use-generative-ai-to-produce-clear-specs-acceptance-criteria-and-example-implementations-so-they-can-deliver-without-handholding-dot}


## Be intentional about visibility: Run architecture reviews, present designs, and brief stakeholders regularly so your influence is obvious and credited. {#be-intentional-about-visibility-run-architecture-reviews-present-designs-and-brief-stakeholders-regularly-so-your-influence-is-obvious-and-credited-dot}
